Revit 2023 API
AreaReinforcement.SetSolidInView Method
 Sets this Area Reinforcement to be shown solidly in a 3D view.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2014
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2023 and may be removed in a later version of Revit. The AreaReinforcement will always be shown solidly in 3D views with Fine level of detail. To change this, you can override the detail level of view for Structural Rebar category.")]
public void SetSolidInView(
	View3D view,
	bool solid
)
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2023 and may be removed in a later version of Revit. The AreaReinforcement will always be shown solidly in 3D views with Fine level of detail. To change this, you can override the detail level of view for Structural Rebar category.")> _
Public Sub SetSolidInView ( _
	view As View3D, _
	solid As Boolean _
)
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2023 and may be removed in a later version of Revit. The AreaReinforcement will always be shown solidly in 3D views with Fine level of detail. To change this, you can override the detail level of view for Structural Rebar category.")]
public:
void SetSolidInView(
	View3D^ view,
	bool solid
)
Parameters
view
Type: Autodesk.Revit.DB.View3D
 The 3D view element
solid
Type: System.Boolean
 True if Area Reinforcement is shown solidly, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.DisabledDisciplineException |  None of the following disciplines is enabled: Structural.
Autodesk.Revit.Exceptions.InapplicableDataException |  This element doesn't have valid visibility data.
See Also
AreaReinforcement Class
Autodesk.Revit.DB.Structure Namespace